; domain
(define (domain blocksworld)
  (:requirements :strips)
(:predicates (clear ?x)
             (on-table ?x)
             (arm-empty)
             (holding ?x)
             (on ?x ?y))

(:action pickup
  :parameters (?ob)
  :precondition (and (clear ?ob) (on-table ?ob) (arm-empty))
  :effect (and (holding ?ob) (not (clear ?ob)) (not (on-table ?ob))
               (not (arm-empty))))

(:action putdown
  :parameters  (?ob)
  :precondition (holding ?ob)
  :effect (and (clear ?ob) (arm-empty) (on-table ?ob)
               (not (holding ?ob))))

(:action stack
  :parameters  (?ob ?underob)
  :precondition (and (clear ?underob) (holding ?ob))
  :effect (and (arm-empty) (clear ?ob) (on ?ob ?underob)
               (not (clear ?underob)) (not (holding ?ob))))

(:action unstack
  :parameters  (?ob ?underob)
  :precondition (and (on ?ob ?underob) (clear ?ob) (arm-empty))
  :effect (and (holding ?ob) (clear ?underob)
               (not (on ?ob ?underob)) (not (clear ?ob)) (not (arm-empty)))))

; problem
;; blocks=234, out_folder=./training, instance_id=38, seed=2062, goal_proportion=0.03

(define (problem blocksworld-38)
 (:domain blocksworld)
 (:objects b1 b2 b3 b4 b5 b6 b7 b8 b9 b10 b11 b12 b13 b14 b15 b16 b17 b18 b19 b20 b21 b22 b23 b24 b25 b26 b27 b28 b29 b30 b31 b32 b33 b34 b35 b36 b37 b38 b39 b40 b41 b42 b43 b44 b45 b46 b47 b48 b49 b50 b51 b52 b53 b54 b55 b56 b57 b58 b59 b60 b61 b62 b63 b64 b65 b66 b67 b68 b69 b70 b71 b72 b73 b74 b75 b76 b77 b78 b79 b80 b81 b82 b83 b84 b85 b86 b87 b88 b89 b90 b91 b92 b93 b94 b95 b96 b97 b98 b99 b100 b101 b102 b103 b104 b105 b106 b107 b108 b109 b110 b111 b112 b113 b114 b115 b116 b117 b118 b119 b120 b121 b122 b123 b124 b125 b126 b127 b128 b129 b130 b131 b132 b133 b134 b135 b136 b137 b138 b139 b140 b141 b142 b143 b144 b145 b146 b147 b148 b149 b150 b151 b152 b153 b154 b155 b156 b157 b158 b159 b160 b161 b162 b163 b164 b165 b166 b167 b168 b169 b170 b171 b172 b173 b174 b175 b176 b177 b178 b179 b180 b181 b182 b183 b184 b185 b186 b187 b188 b189 b190 b191 b192 b193 b194 b195 b196 b197 b198 b199 b200 b201 b202 b203 b204 b205 b206 b207 b208 b209 b210 b211 b212 b213 b214 b215 b216 b217 b218 b219 b220 b221 b222 b223 b224 b225 b226 b227 b228 b229 b230 b231 b232 b233 b234 - object)
 (:init 
    (arm-empty)
    (clear b223)
    (on b223 b138)
    (on b138 b11)
    (on b11 b28)
    (on b28 b25)
    (on b25 b152)
    (on b152 b37)
    (on b37 b141)
    (on b141 b131)
    (on-table b131)
    (clear b77)
    (on b77 b43)
    (on b43 b179)
    (on-table b179)
    (clear b150)
    (on b150 b62)
    (on b62 b50)
    (on b50 b89)
    (on b89 b108)
    (on b108 b132)
    (on-table b132)
    (clear b143)
    (on b143 b78)
    (on-table b78)
    (clear b73)
    (on b73 b192)
    (on-table b192)
    (clear b83)
    (on b83 b95)
    (on b95 b110)
    (on b110 b84)
    (on-table b84)
    (clear b44)
    (on b44 b49)
    (on-table b49)
    (clear b211)
    (on b211 b144)
    (on-table b144)
    (clear b172)
    (on b172 b184)
    (on b184 b127)
    (on-table b127)
    (clear b70)
    (on b70 b199)
    (on b199 b16)
    (on-table b16)
    (clear b109)
    (on b109 b20)
    (on b20 b24)
    (on b24 b209)
    (on b209 b156)
    (on b156 b2)
    (on-table b2)
    (clear b33)
    (on b33 b40)
    (on b40 b200)
    (on b200 b166)
    (on b166 b162)
    (on b162 b72)
    (on b72 b91)
    (on b91 b106)
    (on b106 b178)
    (on b178 b181)
    (on b181 b174)
    (on b174 b23)
    (on b23 b175)
    (on-table b175)
    (clear b234)
    (on b234 b39)
    (on b39 b121)
    (on b121 b215)
    (on b215 b118)
    (on-table b118)
    (clear b227)
    (on-table b227)
    (clear b90)
    (on b90 b157)
    (on b157 b197)
    (on b197 b173)
    (on b173 b126)
    (on b126 b21)
    (on b21 b129)
    (on b129 b31)
    (on b31 b82)
    (on-table b82)
    (clear b67)
    (on b67 b191)
    (on b191 b92)
    (on-table b92)
    (clear b18)
    (on-table b18)
    (clear b188)
    (on-table b188)
    (clear b85)
    (on b85 b182)
    (on-table b182)
    (clear b58)
    (on b58 b9)
    (on-table b9)
    (clear b228)
    (on-table b228)
    (clear b207)
    (on b207 b102)
    (on b102 b60)
    (on-table b60)
    (clear b148)
    (on b148 b56)
    (on b56 b64)
    (on b64 b1)
    (on b1 b48)
    (on b48 b100)
    (on b100 b193)
    (on b193 b52)
    (on-table b52)
    (clear b180)
    (on-table b180)
    (clear b222)
    (on b222 b225)
    (on b225 b196)
    (on-table b196)
    (clear b124)
    (on b124 b216)
    (on b216 b88)
    (on-table b88)
    (clear b99)
    (on b99 b142)
    (on-table b142)
    (clear b189)
    (on b189 b10)
    (on b10 b217)
    (on b217 b93)
    (on-table b93)
    (clear b163)
    (on b163 b14)
    (on b14 b125)
    (on b125 b75)
    (on b75 b94)
    (on b94 b171)
    (on b171 b111)
    (on-table b111)
    (clear b224)
    (on-table b224)
    (clear b154)
    (on-table b154)
    (clear b98)
    (on b98 b105)
    (on b105 b22)
    (on-table b22)
    (clear b167)
    (on b167 b3)
    (on b3 b54)
    (on b54 b128)
    (on-table b128)
    (clear b71)
    (on b71 b119)
    (on b119 b220)
    (on b220 b202)
    (on b202 b194)
    (on b194 b55)
    (on b55 b112)
    (on b112 b214)
    (on b214 b68)
    (on b68 b57)
    (on b57 b17)
    (on b17 b7)
    (on-table b7)
    (clear b158)
    (on-table b158)
    (clear b63)
    (on b63 b151)
    (on b151 b218)
    (on b218 b195)
    (on b195 b145)
    (on-table b145)
    (clear b177)
    (on b177 b122)
    (on-table b122)
    (clear b153)
    (on b153 b169)
    (on b169 b113)
    (on b113 b183)
    (on b183 b219)
    (on b219 b29)
    (on b29 b147)
    (on b147 b231)
    (on b231 b117)
    (on b117 b168)
    (on-table b168)
    (clear b185)
    (on b185 b59)
    (on b59 b32)
    (on b32 b30)
    (on b30 b74)
    (on b74 b76)
    (on b76 b101)
    (on b101 b97)
    (on b97 b81)
    (on b81 b130)
    (on b130 b103)
    (on b103 b140)
    (on b140 b6)
    (on b6 b19)
    (on b19 b51)
    (on b51 b116)
    (on b116 b69)
    (on b69 b229)
    (on b229 b12)
    (on b12 b26)
    (on b26 b198)
    (on-table b198)
    (clear b159)
    (on b159 b107)
    (on b107 b137)
    (on-table b137)
    (clear b47)
    (on b47 b8)
    (on b8 b45)
    (on b45 b133)
    (on b133 b232)
    (on b232 b79)
    (on b79 b155)
    (on b155 b164)
    (on b164 b210)
    (on b210 b61)
    (on b61 b41)
    (on b41 b46)
    (on-table b46)
    (clear b35)
    (on-table b35)
    (clear b104)
    (on b104 b13)
    (on b13 b165)
    (on-table b165)
    (clear b27)
    (on b27 b170)
    (on b170 b80)
    (on b80 b34)
    (on b34 b36)
    (on b36 b208)
    (on b208 b123)
    (on b123 b233)
    (on b233 b201)
    (on b201 b134)
    (on b134 b53)
    (on-table b53)
    (clear b149)
    (on-table b149)
    (clear b66)
    (on b66 b205)
    (on-table b205)
    (clear b213)
    (on b213 b161)
    (on b161 b176)
    (on b176 b65)
    (on b65 b4)
    (on b4 b15)
    (on b15 b146)
    (on b146 b212)
    (on-table b212)
    (clear b120)
    (on b120 b38)
    (on b38 b206)
    (on b206 b96)
    (on b96 b87)
    (on b87 b136)
    (on b136 b187)
    (on b187 b139)
    (on-table b139)
    (clear b5)
    (on-table b5)
    (clear b115)
    (on b115 b230)
    (on-table b230)
    (clear b203)
    (on b203 b221)
    (on b221 b42)
    (on-table b42)
    (clear b190)
    (on b190 b186)
    (on-table b186)
    (clear b204)
    (on b204 b135)
    (on b135 b114)
    (on-table b114)
    (clear b160)
    (on-table b160)
    (clear b86)
    (on-table b86)
    (clear b226)
    (on-table b226))
 (:goal  (and 
    (clear b2)
    (on b2 b3)
    (on b3 b6)
    (on-table b6)
    (clear b4)
    (on b4 b5)
    (on-table b5)
    (clear b1)
    (on b1 b7)
    (on-table b7))))

; plan
1. (unstack b109 b20)
   deleted: (on b109 b20) (clear b109) (arm-empty)
   added: (holding b109) (clear b20)
   goals met: 2 of 10
2. (putdown b109)
   deleted: (holding b109)
   added: (clear b109) (arm-empty) (on-table b109)
   goals met: 2 of 10
3. (unstack b148 b56)
   deleted: (on b148 b56) (clear b148) (arm-empty)
   added: (holding b148) (clear b56)
   goals met: 2 of 10
4. (putdown b148)
   deleted: (holding b148)
   added: (clear b148) (arm-empty) (on-table b148)
   goals met: 2 of 10
5. (unstack b167 b3)
   deleted: (on b167 b3) (clear b167) (arm-empty)
   added: (holding b167) (clear b3)
   goals met: 2 of 10
6. (putdown b167)
   deleted: (holding b167)
   added: (clear b167) (arm-empty) (on-table b167)
   goals met: 2 of 10
7. (unstack b185 b59)
   deleted: (on b185 b59) (clear b185) (arm-empty)
   added: (holding b185) (clear b59)
   goals met: 2 of 10
8. (putdown b185)
   deleted: (holding b185)
   added: (clear b185) (arm-empty) (on-table b185)
   goals met: 2 of 10
9. (unstack b20 b24)
   deleted: (on b20 b24) (clear b20) (arm-empty)
   added: (holding b20) (clear b24)
   goals met: 2 of 10
10. (putdown b20)
   deleted: (holding b20)
   added: (clear b20) (arm-empty) (on-table b20)
   goals met: 2 of 10
11. (unstack b213 b161)
   deleted: (on b213 b161) (clear b213) (arm-empty)
   added: (holding b213) (clear b161)
   goals met: 2 of 10
12. (putdown b213)
   deleted: (holding b213)
   added: (clear b213) (arm-empty) (on-table b213)
   goals met: 2 of 10
13. (unstack b161 b176)
   deleted: (on b161 b176) (clear b161) (arm-empty)
   added: (holding b161) (clear b176)
   goals met: 2 of 10
14. (putdown b161)
   deleted: (holding b161)
   added: (clear b161) (arm-empty) (on-table b161)
   goals met: 2 of 10
15. (unstack b176 b65)
   deleted: (on b176 b65) (clear b176) (arm-empty)
   added: (holding b176) (clear b65)
   goals met: 2 of 10
16. (putdown b176)
   deleted: (holding b176)
   added: (clear b176) (arm-empty) (on-table b176)
   goals met: 2 of 10
17. (unstack b24 b209)
   deleted: (on b24 b209) (clear b24) (arm-empty)
   added: (holding b24) (clear b209)
   goals met: 2 of 10
18. (putdown b24)
   deleted: (holding b24)
   added: (clear b24) (arm-empty) (on-table b24)
   goals met: 2 of 10
19. (unstack b209 b156)
   deleted: (on b209 b156) (clear b209) (arm-empty)
   added: (holding b209) (clear b156)
   goals met: 2 of 10
20. (putdown b209)
   deleted: (holding b209)
   added: (clear b209) (arm-empty) (on-table b209)
   goals met: 2 of 10
21. (unstack b156 b2)
   deleted: (on b156 b2) (clear b156) (arm-empty)
   added: (holding b156) (clear b2)
   goals met: 3 of 10
22. (putdown b156)
   deleted: (holding b156)
   added: (clear b156) (arm-empty) (on-table b156)
   goals met: 3 of 10
23. (unstack b56 b64)
   deleted: (on b56 b64) (clear b56) (arm-empty)
   added: (holding b56) (clear b64)
   goals met: 3 of 10
24. (putdown b56)
   deleted: (holding b56)
   added: (clear b56) (arm-empty) (on-table b56)
   goals met: 3 of 10
25. (unstack b59 b32)
   deleted: (on b59 b32) (clear b59) (arm-empty)
   added: (holding b59) (clear b32)
   goals met: 3 of 10
26. (putdown b59)
   deleted: (holding b59)
   added: (clear b59) (arm-empty) (on-table b59)
   goals met: 3 of 10
27. (unstack b32 b30)
   deleted: (on b32 b30) (clear b32) (arm-empty)
   added: (holding b32) (clear b30)
   goals met: 3 of 10
28. (putdown b32)
   deleted: (holding b32)
   added: (clear b32) (arm-empty) (on-table b32)
   goals met: 3 of 10
29. (unstack b30 b74)
   deleted: (on b30 b74) (clear b30) (arm-empty)
   added: (holding b30) (clear b74)
   goals met: 3 of 10
30. (putdown b30)
   deleted: (holding b30)
   added: (clear b30) (arm-empty) (on-table b30)
   goals met: 3 of 10
31. (unstack b64 b1)
   deleted: (on b64 b1) (clear b64) (arm-empty)
   added: (holding b64) (clear b1)
   goals met: 4 of 10
32. (putdown b64)
   deleted: (holding b64)
   added: (clear b64) (arm-empty) (on-table b64)
   goals met: 4 of 10
33. (unstack b65 b4)
   deleted: (on b65 b4) (clear b65) (arm-empty)
   added: (holding b65) (clear b4)
   goals met: 5 of 10
34. (putdown b65)
   deleted: (holding b65)
   added: (clear b65) (arm-empty) (on-table b65)
   goals met: 5 of 10
35. (unstack b71 b119)
   deleted: (on b71 b119) (clear b71) (arm-empty)
   added: (holding b71) (clear b119)
   goals met: 5 of 10
36. (putdown b71)
   deleted: (holding b71)
   added: (clear b71) (arm-empty) (on-table b71)
   goals met: 5 of 10
37. (unstack b119 b220)
   deleted: (on b119 b220) (clear b119) (arm-empty)
   added: (holding b119) (clear b220)
   goals met: 5 of 10
38. (putdown b119)
   deleted: (holding b119)
   added: (clear b119) (arm-empty) (on-table b119)
   goals met: 5 of 10
39. (unstack b220 b202)
   deleted: (on b220 b202) (clear b220) (arm-empty)
   added: (holding b220) (clear b202)
   goals met: 5 of 10
40. (putdown b220)
   deleted: (holding b220)
   added: (clear b220) (arm-empty) (on-table b220)
   goals met: 5 of 10
41. (unstack b202 b194)
   deleted: (on b202 b194) (clear b202) (arm-empty)
   added: (holding b202) (clear b194)
   goals met: 5 of 10
42. (putdown b202)
   deleted: (holding b202)
   added: (clear b202) (arm-empty) (on-table b202)
   goals met: 5 of 10
43. (unstack b194 b55)
   deleted: (on b194 b55) (clear b194) (arm-empty)
   added: (holding b194) (clear b55)
   goals met: 5 of 10
44. (putdown b194)
   deleted: (holding b194)
   added: (clear b194) (arm-empty) (on-table b194)
   goals met: 5 of 10
45. (unstack b55 b112)
   deleted: (on b55 b112) (clear b55) (arm-empty)
   added: (holding b55) (clear b112)
   goals met: 5 of 10
46. (putdown b55)
   deleted: (holding b55)
   added: (clear b55) (arm-empty) (on-table b55)
   goals met: 5 of 10
47. (unstack b112 b214)
   deleted: (on b112 b214) (clear b112) (arm-empty)
   added: (holding b112) (clear b214)
   goals met: 5 of 10
48. (putdown b112)
   deleted: (holding b112)
   added: (clear b112) (arm-empty) (on-table b112)
   goals met: 5 of 10
49. (unstack b214 b68)
   deleted: (on b214 b68) (clear b214) (arm-empty)
   added: (holding b214) (clear b68)
   goals met: 5 of 10
50. (putdown b214)
   deleted: (holding b214)
   added: (clear b214) (arm-empty) (on-table b214)
   goals met: 5 of 10
51. (unstack b68 b57)
   deleted: (on b68 b57) (clear b68) (arm-empty)
   added: (holding b68) (clear b57)
   goals met: 5 of 10
52. (putdown b68)
   deleted: (holding b68)
   added: (clear b68) (arm-empty) (on-table b68)
   goals met: 5 of 10
53. (unstack b57 b17)
   deleted: (on b57 b17) (clear b57) (arm-empty)
   added: (holding b57) (clear b17)
   goals met: 5 of 10
54. (putdown b57)
   deleted: (holding b57)
   added: (clear b57) (arm-empty) (on-table b57)
   goals met: 5 of 10
55. (unstack b17 b7)
   deleted: (on b17 b7) (clear b17) (arm-empty)
   added: (holding b17) (clear b7)
   goals met: 5 of 10
56. (putdown b17)
   deleted: (holding b17)
   added: (clear b17) (arm-empty) (on-table b17)
   goals met: 5 of 10
57. (unstack b74 b76)
   deleted: (on b74 b76) (clear b74) (arm-empty)
   added: (holding b74) (clear b76)
   goals met: 5 of 10
58. (putdown b74)
   deleted: (holding b74)
   added: (clear b74) (arm-empty) (on-table b74)
   goals met: 5 of 10
59. (unstack b76 b101)
   deleted: (on b76 b101) (clear b76) (arm-empty)
   added: (holding b76) (clear b101)
   goals met: 5 of 10
60. (putdown b76)
   deleted: (holding b76)
   added: (clear b76) (arm-empty) (on-table b76)
   goals met: 5 of 10
61. (unstack b101 b97)
   deleted: (on b101 b97) (clear b101) (arm-empty)
   added: (holding b101) (clear b97)
   goals met: 5 of 10
62. (putdown b101)
   deleted: (holding b101)
   added: (clear b101) (arm-empty) (on-table b101)
   goals met: 5 of 10
63. (unstack b97 b81)
   deleted: (on b97 b81) (clear b97) (arm-empty)
   added: (holding b97) (clear b81)
   goals met: 5 of 10
64. (putdown b97)
   deleted: (holding b97)
   added: (clear b97) (arm-empty) (on-table b97)
   goals met: 5 of 10
65. (unstack b81 b130)
   deleted: (on b81 b130) (clear b81) (arm-empty)
   added: (holding b81) (clear b130)
   goals met: 5 of 10
66. (putdown b81)
   deleted: (holding b81)
   added: (clear b81) (arm-empty) (on-table b81)
   goals met: 5 of 10
67. (unstack b130 b103)
   deleted: (on b130 b103) (clear b130) (arm-empty)
   added: (holding b130) (clear b103)
   goals met: 5 of 10
68. (putdown b130)
   deleted: (holding b130)
   added: (clear b130) (arm-empty) (on-table b130)
   goals met: 5 of 10
69. (unstack b103 b140)
   deleted: (on b103 b140) (clear b103) (arm-empty)
   added: (holding b103) (clear b140)
   goals met: 5 of 10
70. (putdown b103)
   deleted: (holding b103)
   added: (clear b103) (arm-empty) (on-table b103)
   goals met: 5 of 10
71. (unstack b140 b6)
   deleted: (on b140 b6) (clear b140) (arm-empty)
   added: (holding b140) (clear b6)
   goals met: 5 of 10
72. (putdown b140)
   deleted: (holding b140)
   added: (clear b140) (arm-empty) (on-table b140)
   goals met: 5 of 10
73. (unstack b6 b19)
   deleted: (on b6 b19) (clear b6) (arm-empty)
   added: (holding b6) (clear b19)
   goals met: 5 of 10
74. (putdown b6)
   deleted: (holding b6)
   added: (clear b6) (arm-empty) (on-table b6)
   goals met: 6 of 10
75. (unstack b3 b54)
   deleted: (on b3 b54) (clear b3) (arm-empty)
   added: (holding b3) (clear b54)
   goals met: 6 of 10
76. (stack b3 b6)
   deleted: (clear b6) (holding b3)
   added: (arm-empty) (clear b3) (on b3 b6)
   goals met: 7 of 10
77. (unstack b1 b48)
   deleted: (on b1 b48) (clear b1) (arm-empty)
   added: (holding b1) (clear b48)
   goals met: 6 of 10
78. (stack b1 b7)
   deleted: (clear b7) (holding b1)
   added: (arm-empty) (clear b1) (on b1 b7)
   goals met: 8 of 10
79. (pickup b2)
   deleted: (clear b2) (on-table b2) (arm-empty)
   added: (holding b2)
   goals met: 7 of 10
80. (stack b2 b3)
   deleted: (clear b3) (holding b2)
   added: (arm-empty) (clear b2) (on b2 b3)
   goals met: 9 of 10
81. (unstack b4 b15)
   deleted: (on b4 b15) (clear b4) (arm-empty)
   added: (holding b4) (clear b15)
   goals met: 8 of 10
82. (stack b4 b5)
   deleted: (clear b5) (holding b4)
   added: (arm-empty) (clear b4) (on b4 b5)
   goals met: 10 of 10
